package com.java.tao.controller;

import com.java.tao.gaode.pingan_20191114.PASortResult;
import com.java.tao.gaode.pingan_20191114.Sort;
import com.java.tao.utils.TxtUtil;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;
import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.ResponseBody;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.Map;
import java.util.concurrent.Callable;
import java.util.concurrent.ExecutorService;
import java.util.concurrent.Executors;
import java.util.concurrent.Future;

@Controller
@RequestMapping("/pingan")
public class PingAnController {
    private static final Logger LOGGER = LoggerFactory.getLogger(PingAnController.class);

    @RequestMapping("/run")
    @ResponseBody
    public static String run() {
        LOGGER.warn("pingan task starting ......");
        ExecutorService service = Executors.newFixedThreadPool(50);
        List<Future<PASortResult>> futures = new ArrayList<Future<PASortResult>>();
        for (final String method : methods){
            Future<PASortResult> future = service.submit(new Callable<PASortResult>() {
                public PASortResult call() throws Exception {
                    String[] s = method.split("_");
                    String m = "m_"+s[0];
                    String head = s[0]+" "+s[1]+" "+s[2];
                    PASortResult paSortResult = sortWrite(head, list, m);
                    return paSortResult;
                }
            });
            futures.add(future);
        }
        LOGGER.info("Task all running");
        for (Future<PASortResult> future : futures){
            String head = "";
            try {
                PASortResult pa = future.get();
                head = pa.getHead();
                LOGGER.info(pa.getHead()+" write start");
                TxtUtil.write(pa.getHead());
                TxtUtil.write(pa.getBanks());
                TxtUtil.write(pa.getSorces());
            } catch (Exception e) {
                e.printStackTrace();
            }finally {
                LOGGER.info(head+" write end");
            }
        }
        LOGGER.info("Task all end");
        return "success";
    }

    public static PASortResult sortWrite(String head, List<String> banks, String method){
        LOGGER.info(head+" sort write start");
        PASortResult r = new PASortResult();
        r.setHead(head);
        Map<String, Object> map = Sort.sortMethod(method, banks);
        StringBuilder bank = new StringBuilder();
        StringBuilder score = new StringBuilder();
        if(map!=null){
            for (Map.Entry<String, Object> m : map.entrySet()){
                bank.append("\""+m.getKey()+"\",");
                score.append("\""+m.getValue()+"\",");
            }
        }
        bank.deleteCharAt(bank.length()-1);
        score.deleteCharAt(score.length()-1);
        r.setBanks(bank.toString());
        r.setSorces(score.toString());
        LOGGER.info(head+" sort write end");
        return r;
    }

    private static List<String> methods = Arrays.asList("101_常驻人口分布_月均客流画像-日均客流指数",
            "102_人口标签特性-年龄_月均客流画像-年龄结构",
            "103_人口标签特性-资产_月均客流画像-资产等级分布",
            "104_人口标签特性-学历_月均客流画像-学历分布",
            "105_人口标签特性-家庭主妇_月均客流画像-职业分布",
            "106_人口标签特性-政事业单位员工_月均客流画像-职业分布",
            "107_人口标签特性-蓝领工人_月均客流画像-职业分布",
            "108_工作日客流_工作日客流画像-日均客流指数",
            "109_节假日客流_节假日客流画像-日均客流指数",
            "110_月均客流24小时方差_月均客流画像-24小时客流分布",
            "111_24小时节假日客流方差_节假日客流画像-24小时客流分布",
            "112_24小时工作日客流方差_工作日客流画像-24小时客流分布",
            "201_活跃人口竞业指数_月均客流画像-行业分布",
            "202_居住人口竞业指数_居住人口画像-行业分布",
            "203_工作人口竞业指数_工作人口画像-行业分布",
            "204_网点附近竞业分布情况-中信银行_地理数据-品牌poi统计",
            "205_网点附近竞业分布情况-广发银行_地理数据-品牌poi统计",
            "206_网点附近竞业分布情况-招商银行_地理数据-品牌poi统计",
            "207_网点附近竞业分布情况-民生银行_地理数据-品牌poi统计",
            "208_网点附近竞业分布情况-兴业银行_地理数据-品牌poi统计",
            "209_网点附近竞业分布情况-浦发银行_地理数据-品牌poi统计",
            "210_网点附近竞业分布情况-光大银行_地理数据-品牌poi统计",
            "211_网点附近竞业分布情况-中国银行_地理数据-品牌poi统计",
            "212_网点附近竞业分布情况-工商银行_地理数据-品牌poi统计",
            "301_社区常驻人口指数_居住人口画像-日均人口总数",
            "302_社区人口年龄结构_居住人口画像-年龄结构",
            "303_社区周边设施-三甲医院_地理数据-聚客点统计",
            "304_社区周边设施-幼儿园_地理数据-聚客点统计",
            "305_社区周边设施-小学_地理数据-聚客点统计",
            "306_社区周边设施-中学_地理数据-聚客点统计",
            "307_社区周边设施-商场_地理数据-聚客点统计",
            "308_网点范围内交通情况-公交站_地理数据-交通设施统计-公交站",
            "309_网点范围内交通情况-地铁站_地理数据-交通设施统计-地铁站",
            "310_网点范围内交通情况-停车场_地理数据-交通设施统计-停车场",
            "311_行业繁荣指数_地理数据-行业POI统计",
            "312_典型行业分布指数-餐饮业_地理数据-行业POI统计",
            "313_典型行业分布指数-购物_地理数据-行业POI统计",
            "314_典型行业分布指数-酒店_地理数据-行业POI统计",
            "315_典型行业分布指数-体育休闲娱乐_地理数据-行业POI统计",
            "316_聚客点指数-综合指数_地理数据-聚客点统计");

    private static List<String> list = Arrays.asList(
            "114.055547,22.538133 1_797_平安银行深圳江苏大厦支行",
            "114.107610,22.540543 2_800_平安银行总行营业部",
            "114.112612,22.568045 3_802_平安银行深圳笋岗支行",
            "114.082669,22.539898 4_803_平安银行深圳福虹支行",
            "113.925108,22.488841 5_804_平安银行深圳蛇口支行",
            "113.925143,22.490461 6_805_平安银行深圳南头支行",
            "114.055547,22.538133 7_806_平安银行深圳沙头角支行",
            "114.120970,22.541141 8_807_平安银行深圳国贸支行",
            "114.063744,22.541941 9_808_平安银行深圳金田支行",
            "114.088454,22.551463 11_810_平安银行深圳长城支行",
            "114.105125,22.545636 12_813_平安银行深圳红宝支行",
            "114.144903,22.547400 14_817_平安银行深圳黄贝岭支行",
            "114.128569,22.571068 15_818_平安银行深圳水贝珠宝支行",
            "114.055547,22.538133 16_819_平安银行深圳宝安支行",
            "113.844920,22.612847 18_821_平安银行深圳金沙支行",
            "114.121635,22.598862 19_822_平安银行深圳罗岗支行",
            "114.089045,22.541340 20_823_平安银行深圳中电支行",
            "113.825728,22.672085 21_824_平安银行深圳福永支行",
            "113.974111,22.588627 22_825_平安银行深圳大学城支行",
            "114.051464,22.538845 23_827_平安银行深圳五洲支行",
            "114.029240,22.626372 24_829_平安银行深圳民治支行",
            "114.138744,22.569389 25_830_平安银行深圳东乐支行",
            "113.853242,22.765772 26_831_平安银行深圳松岗支行",
            "113.987528,22.535400 27_832_平安银行深圳华侨城支行",
            "114.081630,22.532648 28_834_平安银行深圳福星支行",
            "114.055547,22.538133 29_836_平安银行深圳岗厦支行",
            "114.055547,22.538133 30_838_平安银行深圳石厦支行",
            "114.064667,22.521384 31_839_平安银行深圳水围支行",
            "114.083645,22.544530 32_840_平安银行深圳华富支行",
            "114.055547,22.538133 33_841_平安银行深圳新沙支行",
            "114.059750,22.525039 34_842_平安银行深圳皇岗支行",
            "113.925108,22.488841 36_846_平安银行深圳东角头支行",
            "113.934389,22.518758 37_848_平安银行深圳后海支行",
            "113.918253,22.517986 38_849_平安银行深圳南新路支行",
            "113.953498,22.542421 39_850_平安银行深圳大冲支行",
            "113.923369,22.542804 40_851_平安银行深圳南头城支行",
            "113.955925,22.580081 41_852_平安银行深圳西丽支行",
            "114.097045,22.540099 42_853_平安银行深圳福田支行",
            "113.889521,22.781241 43_856_平安银行深圳公明支行",
            "113.877888,22.568315 44_857_平安银行深圳盐田支行",
            "114.312824,22.599250 45_858_平安银行深圳梅沙支行",
            "114.173766,22.561247 46_860_平安银行深圳莲塘支行",
            "114.129115,22.696642 47_864_平安银行深圳平湖支行",
            "114.107636,22.540466 48_865_平安银行深圳碧海湾支行",
            "114.025351,22.537055 49_866_平安银行深圳香蜜湖支行",
            "113.883596,22.580644 50_870_平安银行深圳西乡支行",
            "113.888146,22.560863 51_871_平安银行深圳宝城支行",
            "114.055547,22.538133 52_872_平安银行深圳富士康支行",
            "114.060382,22.618744 53_874_平安银行深圳坂田支行",
            "114.099468,22.564708 54_876_平安银行深圳八卦岭支行",
            "114.053266,22.564454 55_877_平安银行深圳梅林支行",
            "114.055547,22.538133 56_878_平安银行深圳侨香支行",
            "114.026286,22.650150 57_880_平安银行深圳龙华支行",
            "114.054941,22.715554 58_881_平安银行深圳观澜支行",
            "114.053333,22.516364 59_882_平安银行深圳坪山新区支行",
            "114.117047,22.542223 61_885_平安银行深圳三联天彩支行",
            "114.069790,22.617313 62_886_平安银行深圳龙岗支行",
            "114.207801,22.658665 63_887_平安银行深圳横岗支行",
            "114.045195,22.543925 64_889_平安银行深圳福景支行",
            "114.097045,22.540099 65_2101_平安银行深圳分行营业部",
            "114.037822,22.562885 66_2103_平安银行深圳虹湾支行",
            "113.896233,22.501197 68_2106_平安银行深圳青青世界支行",
            "113.919694,22.527850 69_2107_平安银行深圳南山支行",
            "113.951207,22.556469 70_2108_平安银行深圳高新北支行",
            "113.919694,22.527850 71_2109_平安银行深圳常兴支行",
            "114.119718,22.543736 72_2110_平安银行深圳罗湖支行",
            "114.109426,22.553256 73_2112_平安银行深圳桂园支行",
            "113.925143,22.490461 76_2122_平安银行深圳东门支行",
            "113.972986,22.538150 77_2123_平安银行深圳世界之窗支行",
            "114.053994,22.508436 78_2124_平安银行深圳南海支行",
            "114.234922,22.718997 79_2127_平安银行深圳中心城支行",
            "114.053333,22.516364 80_2128_平安银行深圳创业路支行",
            "113.892220,22.579730 81_2129_平安银行深圳新城支行",
            "114.102774,22.558722 82_2131_平安银行深圳旭飞支行",
            "114.271293,22.721160 83_2135_平安银行深圳双龙支行",
            "113.929910,22.527308 84_2136_平安银行深圳深大支行",
            "113.969038,22.530724 85_2137_平安银行深圳红树湾支行",
            "113.939222,22.721248 86_2139_平安银行深圳光明支行",
            "114.053333,22.516364 87_2141_平安银行深圳高新技术区支行",
            "114.024681,22.534089 88_2143_平安银行深圳车公庙支行",
            "114.121635,22.598862 89_2145_平安银行深圳布吉支行",
            "113.822731,22.729058 90_2146_平安银行深圳沙井支行",
            "114.053333,22.516364 91_2148_平安银行深圳益田支行",
            "114.055547,22.538133 92_2150_平安银行深圳梅龙支行",
            "114.055547,22.538133 93_2152_平安银行深圳时代金融支行",
            "113.939446,22.493182 94_2153_平安银行深圳绿海湾支行",
            "114.024909,22.629477 95_2154_平安银行深圳水榭春天支行",
            "113.946124,22.544001 96_2155_平安银行深圳科技园支行",
            "114.060060,22.571487 97_2156_平安银行深圳卓越城支行",
            "114.063683,22.690315 98_2157_平安银行深圳鹭湖支行",
            "113.919694,22.527850 100_2159_平安银行深圳南山智园支行",
            "114.523208,22.534269 101_2160_平安银行深圳大鹏支行",
            "114.055547,22.538133 102_3301_平安银行深圳前海分行营业部",
            "113.865214,22.615389 103_5059_平安银行深圳桃源居社区支行",
            "114.055547,22.538133 108_5256_平安银行深圳西丽湖社区支行",
            "114.053333,22.516364 109_5283_平安银行深圳俊峰丽舍社区支行",
            "114.053333,22.516364 110_5304_平安银行深圳田寮社区支行",
            "114.053333,22.516364 112_5311_平安银行深圳茭塘社区支行",
            "114.053333,22.516364 113_5312_平安银行深圳南岭社区支行");


}
