package com.java.tao.gaode.zero;

import com.alibaba.fastjson.JSONObject;
import com.java.tao.utils.HttpUtils;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

/**
 * 地址网点
 * 获取某个地址的坐标
 */
public class AddressDot {


    public static void main(String[] args) {
        List<String> list = Arrays.asList("1,797,平安银行深圳江苏大厦支行",
                "2,800,平安银行总行营业部",
                "3,802,平安银行深圳笋岗支行",
                "4,803,平安银行深圳福虹支行",
                "5,804,平安银行深圳蛇口支行",
                "6,805,平安银行深圳南头支行",
                "7,806,平安银行深圳沙头角支行",
                "8,807,平安银行深圳国贸支行",
                "9,808,平安银行深圳金田支行",
                "11,810,平安银行深圳长城支行",
                "12,813,平安银行深圳红宝支行",
                "14,817,平安银行深圳黄贝岭支行",
                "15,818,平安银行深圳水贝珠宝支行",
                "16,819,平安银行深圳宝安支行",
                "18,821,平安银行深圳金沙支行",
                "19,822,平安银行深圳罗岗支行",
                "20,823,平安银行深圳中电支行",
                "21,824,平安银行深圳福永支行",
                "22,825,平安银行深圳大学城支行",
                "23,827,平安银行深圳五洲支行",
                "24,829,平安银行深圳民治支行",
                "25,830,平安银行深圳东乐支行",
                "26,831,平安银行深圳松岗支行",
                "27,832,平安银行深圳华侨城支行",
                "28,834,平安银行深圳福星支行",
                "29,836,平安银行深圳岗厦支行",
                "30,838,平安银行深圳石厦支行",
                "31,839,平安银行深圳水围支行",
                "32,840,平安银行深圳华富支行",
                "33,841,平安银行深圳新沙支行",
                "34,842,平安银行深圳皇岗支行",
                "36,846,平安银行深圳东角头支行",
                "37,848,平安银行深圳后海支行",
                "38,849,平安银行深圳南新路支行",
                "39,850,平安银行深圳大冲支行",
                "40,851,平安银行深圳南头城支行",
                "41,852,平安银行深圳西丽支行",
                "42,853,平安银行深圳福田支行",
                "43,856,平安银行深圳公明支行",
                "44,857,平安银行深圳盐田支行",
                "45,858,平安银行深圳梅沙支行",
                "46,860,平安银行深圳莲塘支行",
                "47,864,平安银行深圳平湖支行",
                "48,865,平安银行深圳碧海湾支行",
                "49,866,平安银行深圳香蜜湖支行",
                "50,870,平安银行深圳西乡支行",
                "51,871,平安银行深圳宝城支行",
                "52,872,平安银行深圳富士康支行",
                "53,874,平安银行深圳坂田支行",
                "54,876,平安银行深圳八卦岭支行",
                "55,877,平安银行深圳梅林支行",
                "56,878,平安银行深圳侨香支行",
                "57,880,平安银行深圳龙华支行",
                "58,881,平安银行深圳观澜支行",
                "59,882,平安银行深圳坪山新区支行",
                "61,885,平安银行深圳三联天彩支行",
                "62,886,平安银行深圳龙岗支行",
                "63,887,平安银行深圳横岗支行",
                "64,889,平安银行深圳福景支行",
                "65,2101,平安银行深圳分行营业部",
                "66,2103,平安银行深圳虹湾支行",
                "68,2106,平安银行深圳青青世界支行",
                "69,2107,平安银行深圳南山支行",
                "70,2108,平安银行深圳高新北支行",
                "71,2109,平安银行深圳常兴支行",
                "72,2110,平安银行深圳罗湖支行",
                "73,2112,平安银行深圳桂园支行",
                "76,2122,平安银行深圳东门支行",
                "77,2123,平安银行深圳世界之窗支行",
                "78,2124,平安银行深圳南海支行",
                "79,2127,平安银行深圳中心城支行",
                "80,2128,平安银行深圳创业路支行",
                "81,2129,平安银行深圳新城支行",
                "82,2131,平安银行深圳旭飞支行",
                "83,2135,平安银行深圳双龙支行",
                "84,2136,平安银行深圳深大支行",
                "85,2137,平安银行深圳红树湾支行",
                "86,2139,平安银行深圳光明支行",
                "87,2141,平安银行深圳高新技术区支行",
                "88,2143,平安银行深圳车公庙支行",
                "89,2145,平安银行深圳布吉支行",
                "90,2146,平安银行深圳沙井支行",
                "91,2148,平安银行深圳益田支行",
                "92,2150,平安银行深圳梅龙支行",
                "93,2152,平安银行深圳时代金融支行",
                "94,2153,平安银行深圳绿海湾支行",
                "95,2154,平安银行深圳水榭春天支行",
                "96,2155,平安银行深圳科技园支行",
                "97,2156,平安银行深圳卓越城支行",
                "98,2157,平安银行深圳鹭湖支行",
                "100,2159,平安银行深圳南山智园支行",
                "101,2160,平安银行深圳大鹏支行",
                "102,3301,平安银行深圳前海分行营业部",
                "103,5059,平安银行深圳桃源居社区支行",
                "108,5256,平安银行深圳西丽湖社区支行",
                "109,5283,平安银行深圳俊峰丽舍社区支行",
                "110,5304,平安银行深圳田寮社区支行",
                "112,5311,平安银行深圳茭塘社区支行",
                "113,5312,平安银行深圳南岭社区支行");

        List<String> one = Arrays.asList("113,5312,平安银行深圳南岭社区支行");

        List<String> result = new ArrayList<>();

        for (String str : list){
            String[] strings = str.split(",");

            String url = "http://restapi.amap.com/v3/geocode/geo?key=49dd82537b9e508297375a9aa949a45c&city=深圳&address="+strings[2];
            try {
                String s = HttpUtils.httpGetReq(url);
                Object geocodes = JSONObject.parseObject(s).getJSONArray("geocodes").get(0);
                JSONObject object = JSONObject.parseObject(JSONObject.toJSONString(geocodes));
                String location = object.getString("location");

                //生成脚本命令
                String ssh = "python report_poi_v2.py 201908 "+location+" "+strings[0]+"_"+strings[1]+"_"+strings[2]+" 2.5;";
                result.add(ssh);

            }catch (Exception e){
                System.out.println(str +" error !");
            }
        }

        System.out.println("********************"+result.size()+"*********************");
        for (String str: result){
            System.out.println(str);
        }

    }








}
